In [1]:
import numpy as np
import pandas as pd

In [2]:
a1 = np.random.randint(10, size = 5)
a2 = np.random.randint(10, size = 5)
a3 = np.random.randint(10, size = 5)
a4 = np.random.randint(10, size = 5)

In [3]:
datas = {"column1":a1 , "column2":a2, "column3":a3, "column4":a4}

In [4]:
df = pd.DataFrame(datas)

In [5]:
df

   column1  column2  column3  column4
0        7        5        1        5
1        7        6        5        8
2        2        0        7        6
3        1        0        1        0
4        4        0        7        9

In [6]:
df.index = ["adam","bob","charles","david","eve"]

In [7]:
df

         column1  column2  column3  column4
adam           7        5        1        5
bob            7        6        5        8
charles        2        0        7        6
david          1        0        1        0
eve            4        0        7        9

In [8]:
df["bob":]

         column1  column2  column3  column4
bob            7        6        5        8
charles        2        0        7        6
david          1        0        1        0
eve            4        0        7        9

In [9]:
df[:"david"]

         column1  column2  column3  column4
adam           7        5        1        5
bob            7        6        5        8
charles        2        0        7        6
david          1        0        1        0

In [10]:
df.drop("bob", axis=0) #delete element

         column1  column2  column3  column4
adam           7        5        1        5
charles        2        0        7        6
david          1        0        1        0
eve            4        0        7        9

In [11]:
df

         column1  column2  column3  column4
adam           7        5        1        5
bob            7        6        5        8
charles        2        0        7        6
david          1        0        1        0
eve            4        0        7        9

In [12]:
df.drop("column1", axis=1)

         column2  column3  column4
adam           5        1        5
bob            6        5        8
charles        0        7        6
david          0        1        0
eve            0        7        9

In [13]:
df.drop("column4", axis=1,inplace=True) # axis = 1 means columns

In [14]:
df

         column1  column2  column3
adam           7        5        1
bob            7        6        5
charles        2        0        7
david          1        0        1
eve            4        0        7

In [16]:
#fancy delete
df.drop(["bob","adam"], axis=0)

         column1  column2  column3
charles        2        0        7
david          1        0        1
eve            4        0        7

In [18]:
"adam" in df

False

In [19]:
"column3" in df

True

In [21]:
searchingData = ["column1","column2","column3","column4","bob"]
for i in searchingData:
    print(i in df)

True
True
True
False
False

In [22]:
df["column4"] = np.arange(5)

In [23]:
df

         column1  column2  column3  column4
adam           7        5        1        0
bob            7        6        5        1
charles        2        0        7        2
david          1        0        1        3
eve            4        0        7        4

In [24]:
df["column5"] = df["column3"]*df.column1

In [25]:
df

         column1  column2  column3  column4  column5
adam           7        5        1        0        7
bob            7        6        5        1       35
charles        2        0        7        2       14
david          1        0        1        3        1
eve            4        0        7        4       28